tutorials/multiBeam/constant/heatSourceDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      heatSourceDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sources (beam1 beam2);

beam1
{
    pathName            scanPath_1;    

    absorptionModel     constant;
    
    constantCoeffs
    {
        eta             0.33;
    }
    
    heatSourceModel     superGaussian;
    
    superGaussianCoeffs
    {
        k               2.0;
        dimensions      (85.0e-6 85.0e-6 30e-6);
        nPoints         (10 10 10);
    }
}

beam2
{
    pathName            scanPath_2;    

    absorptionModel     constant;
    
    constantCoeffs
    {
        eta             0.33;
    }
    
    heatSourceModel     superGaussian;
    
    superGaussianCoeffs
    {
        k               2.0;
        dimensions      (85.0e-6 85.0e-6 30e-6);
        nPoints         (10 10 10);
    }
}

refinementModel
{
    refinementModel         none;

    //refinementModel         targetCellLoad;
    
    refinementTemperature   1000;

    buffers
    {
        beam1               (85.0e-6 85.0e-6 100e-6);
        beam2               (85.0e-6 85.0e-6 100e-6);
    }

    targetCellLoadCoeffs
    {
        targetCellsPerProc  5000;
        nBufferVolumes      4;
        maxSearchIter       10;
        timeTolerance       1e-4;
    }
}

// ************************************************************************* //
