tutorials/multiBeam/constant/scanPath_2
Mode    X       Y       Z   Power   Param
1       0.000   5e-5    0   0       0.0
0       0.002   5e-5    0   179.2   0.8
